{
    "schemaVersion": 2,
    "icon": "default",
    "background": "default",
    "containerList": {
        "containers": [
            {
                "blocks": [
                    {
                        "id": "b3ba600d-c2db-4d43-aa77-a59c84f679e3",
                        "type": "markdown",
                        "properties": {
                            "expanded": true
                        },
                        "content": ""
                    },
                    {
                        "id": "1a509de7-ba0d-4893-9b16-eef626635226",
                        "type": "markdown",
                        "properties": {
                            "expanded": true
                        },
                        "content": "# Dynatrace Naming Standards\n\n## ActiveGates\n\n### [**ActiveGate Groups**](https://docs.dynatrace.com/docs/shortlink/activegate-group)\n\nThe ActiveGate Group Name should indicate where the ActiveGate is\nlocated, and what functions it is expected/allowed to perform.\n\nExamples: OnPrem_Routing, Azure_Routing, OnPrem_Extensions,\nAzure_Extensions, OnPrem_Synthetic_Location, Azure_Synthetic_Location\n(where Location can indicate more about the location as needed).\n\n### [**Network Zones**](https://docs.dynatrace.com/docs/shortlink/network-zones)\n\nNetwork Zone names should clearly reflect the location of the ActiveGate\nand can be derived from this verbose example:\nprovider.region.availability-zone.datacenter.tier, and following the\nbest practices of using a period as the delimiter and using lower case\nletters. \n\nExample: onprem.1425, azure.eastus.zone1\n\n## OneAgents\n\n### [**Host Groups**](https://docs.dynatrace.com/docs/shortlink/host-groups)\n\nHost Groups are an extremely important configuration item as they\ncontrol how individual hosts can be configured as a group rather than\none by one, they allow filtering down to specific sets of hosts in the\nUI easily, and they control how processes and services are grouped and\nsplit. A process group or set of services can only belong to a single\nhost group.\n\nThe general rule of thumb with host groups is that the \"application\" and\nthe \"environment\" are key parts of the name. An additional part can be\nthe \"function\" or \"tier\" (such as \"web\", \"app\", \"db\", \"queue\", and so\nforth.\n\nThere is a tradeoff in the granularity choice of using or not using the\nfunction/tier part in that if you elect not to use it, you will not be\nable to edit hosts as a group as well so if you want different\nthresholds for CPU for a web server vs an app server vs a database\nserver, you will need to edit individual hosts (or use the API or other\nmeans to automate it).\n\nIf you do elect to use function/tier as part of the name, you will end\nup with more process groups and more services, often with the same\nnames, which can make it confusing to navigate the UI and know what is\nbeing looked at.\n\nAnother choice is which delimiter to use to separate the \"parts\" of the\nname. Generally, an underscore or a hyphen are the choices here. If one\nof the parts of the name typically contains one of these characters, it\nis best to go with the \"other one\" to avoid parsing issues (as we often\nuse regex to parse the host group to obtain the individual \"parts\" for\ntagging).\n\nDeciding on upper-case only, lower-case only, or mixed case is also\nimportant.\n\nMixed case can be problematic in that it allows too much creativity and\ntends to lead to non-standard names and confusion.\n\nExamples:\n\naccounting_prod, ACCOUNTING_PROD, Accounting_Prod, Accounting_PROD,\nAccounting_prod, prod_accounting, prod_accounting_web,\naccounting_prod_web, accounting_web_prod.\n\nNote that the addition of function/tier complicates the choice of\nordering so that parsing can always be consistent. Also, there is almost\nalways an \"application\" and an \"environment\", but function/tier can be\nmore \"optional\", so we run the risk of complicating the parsing.\n\n## Dynatrace UI\n\n### [**Management Zones**](https://docs.dynatrace.com/docs/shortlink/management-zones-hub)\n\nIt is recommended that a prefix be used to identify the type of\nfiltering being done. For example: \"env: prod\" might be used for a\nfilter of \"all prod entities\", \"os: windows\" for all windows entities,\n\"app: accounting_prod\" for filtering for an application in production,\nand \"app: accounting_web_prod\" for filtering on just the accounting\nproduction web servers (if the function/tier is included in the host\ngroup, or if we can identify the function/tier in another manner, such\nas host property or part of the host name.\n\nExamples:\n\nenv: prod\n\nos: windows\n\napp: accounting_prod\n\napp: accounting_web_prod\n\napp: accounting (for all accounting app entities, across all\nenvironments)\n\nManagement Zones can be created manually, or using automation.\n\n### [Security Context](https://docs.dynatrace.com/docs/shortlink/access-security-context)\n\n[Security\nContext](https://docs.dynatrace.com/docs/shortlink/access-security-context)\nis used to limit user access and can also be used for filtering (via a\nsegment). This is similar to, and will soon replace, Management Zones,\nwhich can also be used for both filtering and access control.\n\nUnfortunately, the mapping of these two elements is a bit cumbersome so\nfar.\n\nThere is the easy option of using an out of the box capability that\ncopies the management zone to the security context. Alternatively, you\ncan set the property directly for maximum future-proofing.\n\nGiven the plan for Management Zones to be retired in the future, the\nrecommendation is to set the security context using the\n\"dt.security_context\" host property.\n\nGenerally, the security context should be identical or similar to the\nhost group, or to the \"application\" part of the host group. If\nfunction/tier is part of the host group, it would likely be left out of\nthe security context, as it would be unlikely that access control would\nneed to be that fine-grained. If there is no need to allow access to the\n\"environment\" (prod vs uat) then just the application name would\nsuffice.\n"
                    }
                ],
                "horizontalLayoutWeight": 1
            }
        ]
    }
}